using Serendip

# ===========================================================
# ================= SLAB DEFINITION =========================
# ===========================================================

# >> Top reinforcement
# 16 ϕ 16.0 @ 155
top_reinforcement = Dict(
    :n => 16
    :ϕ => 16.0
    :Δ => 155
)

# >> Bottom reinforcement
# 16 ϕ 10.0 @ 155
bot_reinforcement = Dict(
    :n => 16,
    :ϕ => 10.0,
    :Δ => 155,
)

# >> U-bar at edges
# 130 (z) x 250 (x or y)
# (2x) ϕ 16.0 @ 155 
u_bar = Dict(
    :n => 2
    :ϕ => 16.0
    :Δ => 155
    :x => 250
    :z => 130
)

# >> Beam proportions 
# values in meters

ℓ =  180e-3    # x direction
b = 2500e-3    # y direction
h = 2500e-3    # z direction

# ===========================================================
# ================= COLUMN DEFINITION =======================
# ===========================================================



# ===========================================================
# ================= GEOMODEL ================================
# ===========================================================

# >> Define box 
# NOTE - Assuming symmetry
geo = GeoModel(size=0.5)

box = add_box(geo, [0, 0, 0], ℓ / 2, b / 2, h; tag="bulk")
